src/Catalogs/onyx_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_Агенты</Name>
			<Comment>Хранение метаданных AI-агентов из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/onyx_Агенты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Возвращает массив ссылок на всех агентов из справочника.
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_Агенты`.
Функция ПолучитьСписок() Экспорт
	
	Ссылки = Новый Массив;
	Выборка = Справочники.onyx_Агенты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Ссылки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Ссылки;
	
КонецФункции

// Находит агента по идентификатору Onyx.
// Параметры:
//   Идентификатор - Число - идентификатор агента Onyx.
// Возвращаемое значение:
//   СправочникСсылка.onyx_Агенты - найденный агент или Неопределено.
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторАгента(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Справочники.onyx_Агенты.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	
КонецФункции

// Создает или обновляет запись агента по данным из API.
// Параметры:
//   ДанныеАгента - Структура, Соответствие - объект данных агента из API.
// Возвращаемое значение:
//   СправочникСсылка.onyx_Агенты - ссылка на созданный или обновленный элемент, либо Неопределено.
Функция СоздатьИлиОбновить(ДанныеАгента) Экспорт
	
	Если ТипЗнч(ДанныеАгента) <> Тип("Структура") И ТипЗнч(ДанныеАгента) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Идентификатор = ПолучитьЗначение(ДанныеАгента, "id");
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторАгента(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = Справочники.onyx_Агенты.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Элемент = Ссылка.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.onyx_Агенты.СоздатьЭлемент();
		Элемент.Идентификатор = Идентификатор;
	КонецЕсли;
	
	ЗаполнитьРеквизиты(Элемент, ДанныеАгента);
	
	Попытка
		Элемент.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Элемент.Ссылка;
	
КонецФункции

// Возвращает идентификатор агента Onyx по ссылке.
// Параметры:
//   СсылкаНаАгента - СправочникСсылка.onyx_Агенты - ссылка на агента.
// Возвращаемое значение:
//   Число - идентификатор агента Onyx или Неопределено.
Функция ПолучитьИдентификатор(СсылкаНаАгента) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаАгента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Агенты.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.onyx_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаАгента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает признак "Агент по умолчанию" по ссылке.
// Параметры:
//   СсылкаНаАгента - СправочникСсылка.onyx_Агенты - ссылка на агента.
// Возвращаемое значение:
//   Булево - признак "Агент по умолчанию" или Неопределено.
Функция ПолучитьАгентПоУмолчанию(СсылкаНаАгента) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаАгента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Агенты.АгентПоУмолчанию КАК АгентПоУмолчанию
		|ИЗ
		|	Справочник.onyx_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаАгента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АгентПоУмолчанию;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет реквизиты элемента агента данными из API.
// Параметры:
//   Элемент - СправочникОбъект.onyx_Агенты - объект элемента справочника.
//   ДанныеАгента - Структура, Соответствие - объект данных агента из API.
Процедура ЗаполнитьРеквизиты(Элемент, ДанныеАгента) Экспорт
	
	Элемент.Наименование           = УсечьСтроку(ПолучитьЗначение(ДанныеАгента, "name"), AgentNameMaxLength());
	Элемент.Описание               = ПолучитьЗначение(ДанныеАгента, "description");
	Элемент.АгентПоУмолчанию       = Логическое(ПолучитьЗначение(ДанныеАгента, "is_default_persona"));
	Элемент.Встроенный             = Логическое(ПолучитьЗначение(ДанныеАгента, "builtin_persona"));
	Элемент.Видимый                = Логическое(ПолучитьЗначение(ДанныеАгента, "is_visible"));
	Элемент.Публичный              = Логическое(ПолучитьЗначение(ДанныеАгента, "is_public"));
	Элемент.ИмяВладельца           =
		УсечьСтроку(
			ПолучитьЗначениеВДочернейСтруктуре(ДанныеАгента, "owner", "email"),
			OwnerEmailMaxLength());
	Элемент.ДатаСоздания =
		ПреобразоватьСтрокуВДату(ПолучитьЗначение(ДанныеАгента, "time_created"));
	Элемент.ДатаСинхронизации      = ТекущаяДатаСеанса();
	Элемент.МодельLLM =
		УсечьСтроку(
			ПолучитьЗначение(ДанныеАгента, "llm_model_version_override"),
			ModelNameMaxLength());
	Элемент.ПровайдерLLM =
		УсечьСтроку(
			ПолучитьЗначение(ДанныеАгента, "llm_model_provider_override"),
			ProviderNameMaxLength());
	
	ЗаполнитьТабличныеЧастиИнструменты(Элемент, ПолучитьЗначение(ДанныеАгента, "tools"));
	ЗаполнитьТабличныеЧастиМетки(Элемент, ПолучитьЗначение(ДанныеАгента, "labels"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

Процедура ЗаполнитьТабличныеЧастиИнструменты(Элемент, МассивИнструментов)
	
	Элемент.Инструменты.Очистить();
	
	Если ТипЗнч(МассивИнструментов) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Инструмент Из МассивИнструментов Цикл
		Если ТипЗнч(Инструмент) <> Тип("Структура") И ТипЗнч(Инструмент) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = Элемент.Инструменты.Добавить();
		СтрокаТЧ.Идентификатор = ПолучитьЗначение(Инструмент, "id");
		СтрокаТЧ.Наименование =
			УсечьСтроку(ПолучитьЗначение(Инструмент, "name"), ToolNameMaxLength());
		СтрокаТЧ.Описание =
			УсечьСтроку(
				ПолучитьЗначение(Инструмент, "description"),
				ToolDescriptionMaxLength());
		СтрокаТЧ.Код =
			УсечьСтроку(ПолучитьЗначение(Инструмент, "in_code_tool_id"), ToolCodeMaxLength());
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиМетки(Элемент, МассивМеток)
	
	Элемент.Метки.Очистить();
	
	Если ТипЗнч(МассивМеток) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Метка Из МассивМеток Цикл
		Если ТипЗнч(Метка) <> Тип("Структура") И ТипЗнч(Метка) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = Элемент.Метки.Добавить();
		СтрокаТЧ.Идентификатор = ПолучитьЗначение(Метка, "id");
		СтрокаТЧ.Наименование =
			УсечьСтроку(ПолучитьЗначение(Метка, "name"), LabelNameMaxLength());
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначение(СтруктураJSON, ИмяПоля)
	
	Если ТипЗнч(СтруктураJSON) = Тип("Структура") И СтруктураJSON.Свойство(ИмяПоля) Тогда
		Возврат СтруктураJSON[ИмяПоля];
	ИначеЕсли ТипЗнч(СтруктураJSON) = Тип("Соответствие") Тогда
		Значение = СтруктураJSON.Получить(ИмяПоля);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьЗначениеВДочернейСтруктуре(СтруктураJSON, ИмяДочернейСтруктуры, ИмяПоля)
	
	ДочерняяСтруктура = ПолучитьЗначение(СтруктураJSON, ИмяДочернейСтруктуры);
	
	Если ТипЗнч(ДочерняяСтруктура) = Тип("Структура") И ДочерняяСтруктура.Свойство(ИмяПоля) Тогда
		Возврат ДочерняяСтруктура[ИмяПоля];
	ИначеЕсли ТипЗнч(ДочерняяСтруктура) = Тип("Соответствие") Тогда
		Значение = ДочерняяСтруктура.Получить(ИмяПоля);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Логическое(Значение)
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Значение = НРег(Значение);
		Возврат Значение = "true" ИЛИ Значение = "истина" ИЛИ Значение = "1";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение <> 0;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция УсечьСтроку(ИсходнаяСтрока, МаксимальнаяДлина)
	
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(ИсходнаяСтрока) <= МаксимальнаяДлина Тогда
		Возврат ИсходнаяСтрока;
	КонецЕсли;
	
	Возврат Лев(ИсходнаяСтрока, МаксимальнаяДлина);
	
КонецФункции

Функция ПреобразоватьСтрокуВДату(СтрокаДаты)
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ConvertIso8601(СтрокаДаты);
	
КонецФункции

Функция ConvertIso8601(СтрокаДаты)
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	НормализованнаяСтрока = СтрЗаменить(СтрокаДаты, "Z", "");
	РазделительДатаВремя = СтрНайти(НормализованнаяСтрока, "T");
	Если РазделительДатаВремя = 0 Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЧастьДаты = Лев(НормализованнаяСтрока, РазделительДатаВремя - 1);
	ЧастьВремени = Сред(НормализованнаяСтрока, РазделительДатаВремя + 1);
	
	МассивДата = СтрРазделить(ЧастьДаты, "-");
	МассивВремя = СтрРазделить(ЧастьВремени, ":");
	
	Год = SafeIntegerFromString(GetArrayItem(МассивДата, IsoYearIndex()), 0);
	Месяц = SafeIntegerFromString(GetArrayItem(МассивДата, IsoMonthIndex()), 1);
	День = SafeIntegerFromString(GetArrayItem(МассивДата, IsoDayIndex()), 1);
	
	Час = SafeIntegerFromString(GetArrayItem(МассивВремя, IsoHourIndex()), 0);
	Минута = SafeIntegerFromString(GetArrayItem(МассивВремя, IsoMinuteIndex()), 0);
	
	СекундноеЗначение = GetArrayItem(МассивВремя, IsoSecondIndex());
	Если ТипЗнч(СекундноеЗначение) = Тип("Строка") Тогда
		МассивСекунд = СтрРазделить(СекундноеЗначение, ".");
		СекундноеЗначение = GetArrayItem(МассивСекунд, IsoFirstIndex());
	КонецЕсли;
	Секунда = SafeIntegerFromString(СекундноеЗначение, 0);
	
	Если Год = 0 Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат Дата(
		Год,
		ClampValue(Месяц, MonthMin(), MonthsInYear()),
		ClampValue(День, DayMin(), MaxDayInMonth()),
		ClampValue(Час, HourMin(), HoursInDay() - 1),
		ClampValue(Минута, MinuteMin(), MinutesInHour() - 1),
		ClampValue(Секунда, SecondMin(), SecondsInMinute() - 1));
	
КонецФункции

Функция SafeIntegerFromString(Значение, ЗначениеПоУмолчанию)
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Цел(Значение);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		НормализованнаяСтрока = СокрЛП(Значение);
		Если СтрСоответствуетРегулярномуВыражению(НормализованнаяСтрока, "^-?\d+$") Тогда
			Возврат Число(НормализованнаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

Функция СтрСоответствуетРегулярномуВыражению(Текст, Шаблон)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Шаблон = "^\d+$" Тогда
		Возврат СтрокаСодержитТолькоЦифры(Текст);
	ИначеЕсли Шаблон = "^-?\d+$" Тогда
		Возврат СтрокаСоответствуетЦеломуСЗнаком(Текст);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СтрокаСодержитТолькоЦифры(ЗначениеСтроки)

	Если ПустаяСтрока(ЗначениеСтроки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Индекс = 1 По СтрДлина(ЗначениеСтроки) Цикл
		Символ = Сред(ЗначениеСтроки, Индекс, 1);
		Если Символ < "0" ИЛИ Символ > "9" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция СтрокаСоответствуетЦеломуСЗнаком(ЗначениеСтроки)

	Если ПустаяСтрока(ЗначениеСтроки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Лев(ЗначениеСтроки, 1) = "-" Тогда
		Если СтрДлина(ЗначениеСтроки) = 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат СтрокаСодержитТолькоЦифры(Сред(ЗначениеСтроки, 2));
	КонецЕсли;

	Возврат СтрокаСодержитТолькоЦифры(ЗначениеСтроки);

КонецФункции

Функция GetArrayItem(МассивЗначений, НомерЭлемента)
	
	Если ТипЗнч(МассивЗначений) = Тип("Массив")
		И МассивЗначений.Количество() >= НомерЭлемента Тогда
		Возврат МассивЗначений[НомерЭлемента - 1];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ClampValue(Значение, Минимум, Максимум)
	
	Если Значение < Минимум Тогда
		Возврат Минимум;
	ИначеЕсли Значение > Максимум Тогда
		Возврат Максимум;
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

Функция AgentNameMaxLength()
	
	Возврат 25;
	
КонецФункции

Функция OwnerEmailMaxLength()
	
	Возврат 100;
	
КонецФункции

Функция ToolNameMaxLength()
	
	Возврат 100;
	
КонецФункции

Функция ToolDescriptionMaxLength()
	
	Возврат 200;
	
КонецФункции

Функция ToolCodeMaxLength()
	
	Возврат 50;
	
КонецФункции

Функция ModelNameMaxLength()
	
	Возврат 150;
	
КонецФункции

Функция ProviderNameMaxLength()
	
	Возврат 150;
	
КонецФункции

Функция LabelNameMaxLength()
	
	Возврат 100;
	
КонецФункции

Функция IsoYearIndex()
	
	Возврат 1;
	
КонецФункции

Функция IsoMonthIndex()
	
	Возврат 2;
	
КонецФункции

Функция IsoDayIndex()
	
	Возврат 3;
	
КонецФункции

Функция IsoHourIndex()
	
	Возврат 1;
	
КонецФункции

Функция IsoMinuteIndex()
	
	Возврат 2;
	
КонецФункции

Функция IsoSecondIndex()
	
	Возврат 3;
	
КонецФункции

Функция IsoFirstIndex()
	
	Возврат 1;
	
КонецФункции

Функция MonthMin()
	
	Возврат 1;
	
КонецФункции

Функция MonthsInYear()
	
	Возврат 12;
	
КонецФункции

Функция DayMin()
	
	Возврат 1;
	
КонецФункции

Функция MaxDayInMonth()
	
	Возврат 31;
	
КонецФункции

Функция HourMin()
	
	Возврат 0;
	
КонецФункции

Функция HoursInDay()
	
	Возврат 24;
	
КонецФункции

Функция MinuteMin()
	
	Возврат 0;
	
КонецФункции

Функция MinutesInHour()
	
	Возврат 60;
	
КонецФункции

Функция SecondMin()
	
	Возврат 0;
	
КонецФункции

Функция SecondsInMinute()
	
	Возврат 60;
	
КонецФункции

#КонецОбласти

#КонецЕсли
